In [2]:
import pandas as pd

In [3]:
# https://www.machinelearningplus.com/python/101-pandas-exercises-python/
# Exercise 4, convert to dataframe
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [4]:
df = pd.DataFrame(ser1, ser2)

In [5]:
df.head()

   0
0  a
1  b
2  c
3  e
4  d

In [8]:
ser12 = pd.concat([ser1, ser2])
#pd.DataFrame(ser12)
ser12.head()

0    a
1    b
2    c
3    e
4    d
dtype: object

In [13]:
# https://www.w3resource.com/python-exercises/pandas/joining-and-merging/index.php
# Exercise 3

df = pd.DataFrame({'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
                  'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'],
                  'marks': [200, 210, 190, 222, 199]})

df.head(10)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [14]:
df1 = pd.DataFrame({'student_id': ['S6'],
                                 'name': ['Scarlette Fisher'],
                                 'marks': [205]})
df2 = pd.concat([df, df1])

df2.head(10)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S6  Scarlette Fisher    205

In [16]:
df3 = df.append(df1)
df3.head(10)

C:\Users\jerem\AppData\Local\Temp\ipykernel_14872\2853630054.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df.append(df1)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S6  Scarlette Fisher    205